Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--proj4_overview.tmx
Source language: en
Languages: ja

source: Proj4 is a library that provides methods to transform between different coordinate reference systems. A geographic coordinate reference system allows all points on the earth to be described as a set of coordinates (such as latitude, longitude and elevation). Different systems are used to represent the tridimensional earth on a flat, bidimensional map.
ja: Proj4は、異なる座標参照システム間で変換するメソッドを提供するライブラリです。地理座標参照システムでは、地球上のすべての点を座標(緯度、経度、高度など)のセットとして記述できます。それぞれのシステムは、平坦な二次元マップ上に三次元地球を表現ししています。

source: Proj4 is used in :doc:`MapServer <mapserver_overview>`, :doc:`GRASS GIS <grass_overview>`, :doc:`PostGIS <postgis_overview>`, :doc:`Mapnik <mapnik_overview>`, Thuban, OGDI, TopoCad, OGRCoordinateTransformation and various others.
ja: Proj4は :doc:`MapServer <mapserver_overview>`, :doc:`GRASS GIS <grass_overview>`, :doc:`PostGIS <postgis_overview>`, :doc:`Mapnik <mapnik_overview>`, Thuban, OGDI, TopoCad, OGRCoordinateTransformation 、その他いろいろなところで使われています。

source: Proj4 has been translated from C to `other languages <https://trac.osgeo.org/metacrs/wiki>`. These sub-projects include: These tools include: * Proj4js (JavaScript) - used in :doc:`OpenLayers <openlayers_overview>`. * CS-Map (C++) - used in MapGuide. * GeoTIFF/libgeotiff (C++). * Proj4J (Java). * `SpatialReference.org <https://spatialreference.org/>`_ - website to retrieve coordinate system definitions (obsolete).
ja: Proj4は、C から `さまざまな言語 <https://trac.osgeo.org/metacrs/wiki>`に変換されています。これらのサブプロジェクトには、* Proj4js (JavaScript) - used in :doc:`OpenLayers <openlayers_overview>`があります。* MapGuideでつかわれているCS-Map (C++)。* GeoTIFF/libgeotiff (C++)。* Proj4J (Java)。* `SpatialReference.org <https://spatialreference.org/>`_ - 座標系定義を取得するためのWebサイトです(旧式)

source: Core Features
ja: 主要機能

source: Provides point transformation from one coordinate reference system to another.
ja: ある座標参照システムから別の座標参照システムへの点変換を提供します。

source: Includes transformation between datums.
ja: データ間の変換が含まれます。

source: Large number of projection classes supported.
ja: 多数の投影クラスがサポートされています。

source: Implemented Standards
ja: 実装されている標準規格

source: Proj4 uses coordinate system definitions defined by the `European Petroleum Survey Group (EPSG) <https://www.epsg.org/>`. Well Known Text (WKT) format.
ja: Proj4は、`European Petroleum Survey Group(EPSG)<https://www.epsg.org/>`によって定義された座標系定義を使用します。Well Known Text(WKT)形式。

source: Details
ja: 詳細

source: **Website:** https://proj4.org/index.html
ja: **Webサイト:** https://proj4.org/index.html

source: **Licence:** `X/MIT style Open Source license <https://trac.osgeo.org/proj4j#License>`_
ja: **ライセンス:** `X/MIT style Open Source license <https://trac.osgeo.org/proj4j#License>`_

source: **Software Version:** 4.9.2 (stable)
ja: **ソフトウェアバージョン:** 4.9.2 (stable)

source: **Supported Platforms:** Windows, Linux, Mac
ja: **対応プラットフォーム:** Windows, Linux, Mac

source: **API Interfaces:** C, C++, Python, Java, Ruby
ja: **API インターフェイス:** C, C++, Python, Java, Ruby

source: **Support:** https://lists.osgeo.org/mailman/listinfo/proj
ja: **サポート:** https://lists.osgeo.org/mailman/listinfo/proj

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/proj4_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/proj4_quickstart>`
